target/test-classes/Travelex_RT_Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns1:RealTimeWSProvider_1 xmlns:ns1="http://eh.actimize.com">
         <requestId>99660867-c4b9-4b71-9926-bbc0aaa62326</requestId>
         <searchDefinitionId>UKSANCTIONSD</searchDefinitionId>
         <generateAlert>true</generateAlert>
         <enableSuppression>false</enableSuppression>
         <partyType>U</partyType>
         <partyKey>101</partyKey>
         <names>
            <ns1:firstName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:fullName>Sa'd bi Sa' Muhamad Shariyann AL-KA'BII</ns1:fullName>
            <ns1:lastName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:maidenName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:middleName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
         </names>
         <aliases>
            <ns1:aliases_InnerSet />
         </aliases>
         <ids>
            <ns1:ids_InnerSet>
               <ns1:RealTimeWSProvider_1_Ids_InnerSet_TupleType>
                  <ns1:idCountry />
                  <ns1:idType />
                  <ns1:idValue />
               </ns1:RealTimeWSProvider_1_Ids_InnerSet_TupleType>
            </ns1:ids_InnerSet>
         </ids>
         <addresses>
            <ns1:addresses_InnerSet>
               <ns1:RealTimeWSProvider_1_Addresses_InnerSet_TupleType>
                  <ns1:city></ns1:city>
                  <ns1:country >QATAR</ns1:country >
                  <ns1:postalCode></ns1:postalCode>
                  <ns1:stateProvince></ns1:stateProvince>
                  <ns1:street1></ns1:street1>
                  <ns1:street2 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"></ns1:street2>
               </ns1:RealTimeWSProvider_1_Addresses_InnerSet_TupleType>
            </ns1:addresses_InnerSet>
         </addresses>
         <dateOfBirth>16/01/1987</dateOfBirth>
         <yearOfBirth />
         <locationOfBirth />
         <countryOfBirth />
         <nationalities>
            <ns1:nationalities_InnerSet />
         </nationalities>
         <gender />
         <title />
         <alertBusinessUnit>1_UnitedKingdom</alertBusinessUnit>
         <customFields>
            <ns1:branch>RTS</ns1:branch>
            <ns1:cs1 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs10 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs11 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs12 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs13 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs14 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs15 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs18 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs6 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs7 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs8 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:cs9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
            <ns1:organization>United Kingdom</ns1:organization>
            <ns1:regionGEO>UK</ns1:regionGEO>
            <ns1:sourceApplicationID>R03</ns1:sourceApplicationID>
            <ns1:sourceCountry>United Kingdom</ns1:sourceCountry>
            <ns1:sourceSystem>RTS United Kingdom UK 2008</ns1:sourceSystem>
         </customFields>
      </ns1:RealTimeWSProvider_1>
   </soap:Body>
</soap:Envelope>